{
  "posts": [
    {
      "id": "dec2024",
      "title": "Fall 2024 Socials and Concessions",
      "author": "Amith Polineni",
      "date": "December 2024",
      "subtitle": "This semester, we've enjoyed social events and manning concessions booths. From marsgiving to a Sabrina Carpenter concert, the MARS team knows how to throw a good func.",
      "sections": [
        {
          "image": "images/dec2024 darden new member social.jpg",
          "title": "First GBM Outdoor Social",
          "date": "September 8th, 2024",
          "content": "After our first GBM, we held a new member social in the courtyard, featuring outdoor games like Frisbee, Spike Ball, and ring toss. Snacks and refreshments were provided, creating an opportunity for new members to connect. The event concluded with a Frisbee circle, where everyone shared their names and got to know each other."
        },
        {
          "images": [
            "images/dec 2024 mech meeting math.jpg",
            "images/dec 2024 volleyball social team pic.jpg"
           ]
        },
        {
          "title": "Subteam Volleyball Competition",
          "date": "September 28th, 2024",
          "content": "We held a volleyball match as the first installment in our ongoing intra-subteam competition, pitting the mechanical subteam against the electrical and computer subteams. After a hard-fought and intense game, the electrical and computer subteams emerged victorious. Having Brian and Winston on the same team was a scary combo, and even though they were throwing a bit, mechanical was throwing harder, costing them the win. Mehcniacal needs a lot of practice if they ever want to rival the compueter/electrical volleyball powerhouse.",
          "image": "images/dec2024 volleyball social.JPG"
        },
        {
          "image": "images/dec2024 yar.jpg",
          "title": "Young Alumni Reunion",
           "date": "October 5th, 2024",
          "content": "During Young Alumni Reunion Weekend, recent MARS graduates returned to Grounds to reconnect with former teammates and meet the new generation of MARS engineers. Despite a lengthy chicken shenanigans, we managed to secure Cane's chicken for the team, which everyone thoroughly enjoyed."
        },
         {
          "images": [
            "images/dec2024 sabrina concessions alpha team.JPG",
            "images/dec2024 sabrina concessions beta team.JPG"
           ]
        },
        {
          "title": "Sabrina Carpenter Concert Concessions",
          "date": "October 20th, 2024",
          "content": "When Sabrina Carpenter's Sweet and Sour Tour came to Charlottesville for a sold-out show, MARS took the opportunity to run concessions. Leading up to the event, we prepped by memorizing the setlist, and during the show, we managed to sneak off occasionally to catch glimpses of the performance. Running the booth was a fun experience as we handled cashiers and managed the front-of-house food stands. To top it off, we even got to take home a giant tray of chicken tenders!",
          "image": "images/dec2024 sabrina concessions stage.JPG"
        },
        {
          "image": "images/dec 2024 football concesssions.JPG",
          "title": "Football Game Concessions",
          "date": "October 26th, 2024",
          "content": "For our second concessions day, we headed to Scott Stadium to run a booth during the football game. What made this event unique was that we were the only ones there, with no other employees or managers to assist us. We handled everything ourselves, making on-the-spot decisions as the game unfolded."
        },
        {
          "images": [
            "images/dec 2024 pumkin 1.jpg",
            "images/dec 2024 pumkin 2.jpg",
            "images/dec 2024 pumkin 3.jpg"
           ]
        },
        {
          "title": "Pumpkin Painting",
          "date": "October 27th, 2024",
          "content": "In the spirit of Halloween, MARS hosted its now-annual pumpkin painting event, continuing our series of intra-subteam competitions. After the GBM, everyone gathered in the Lacy MARS room, picked out a pumpkin, and began painting their designs. Once finished, we voted on the best pumpkins. Mechanical took home the prize for best large pumpkin with Nayeon and Criag's Buc-ee's design, while Electrical won best small pumpkin with Swedha's Phineas and Ferb pumpkin.",
          "image": "images/dec 2024 pumkin painting.JPG"
        },
        {
          "image": "images/dec 2024 spooky moive.JPG",
          "title": "Spooky Movie night",
          "date": "October 30th, 2024",
          "content": "In the spirit of Halloween, MARS hosted its first annual spooky movie night, featuring The Blair Witch Project. While it wasn’t as terrifying as anticipated, it was a great time watching and unraveling the mysterious storyline together. While most of us remained unfazed, Craig was absolutely petrified during the night scenes."
        },
        {
          "images": [
            "images/dec 2024 movie night dinner pregame.jpg",
            "images/dec 2024 marsgiving.jpg"
           ]
        },
        {
          "title": "MARSGIVING",
          "date": "November 20th, 2024",
          "content": "Just before the Thanksgiving holiday, MARS hosted its own version of Friendsgiving—Marsgiving! This event is widely considered the favorite social gathering among MARS members. We kicked off the night by preparing a delicious Thanksgiving spread, including mashed potatoes, mac and cheese, stuffing, and warming up store-bought turkey. The evening was filled with shenanigans, including a cheap vs. expensive mac and cheese contest and trolling Craig until he cracked. We wrapped up the night with an epic karaoke session, singing our hearts out and blasting our favorite songs at full volume.",
          "image": "images/dec 2024 marsgiving kareoke.jpg"
        },
        {
          "image": "images/dec 2024 2nd scary movie night.jpg",
           "title": "Scary movie + Concessions",
           "date": "November 23th, 2024",
          "content": "We had a 2nd scary movie night where we watched Smile:) late into the night, followed by another football concesisons session the following morning.",
          "image": "images/dec 2024 2nd football concessions.jpg"
        },
        {
          "images": [
            "images/dec 2024 gingerbread house 1.jpg",
            "images/dec 2024 gingerbread house 2.jpg",
            "images/dec 2024 gingerbread house 3.jpg"
           ]
        },
         {
          "title": "Gingerbread House Contest",
          "date": "Dec 8th, 2024",
          "content": "To get into the holiday spirit, we held a gingerbread house-making contest. After the GBM, MARS members paired up and took on the challenge of assembling the best gingerbread house using a kit. This event was part of our ongoing intra-subteam competition (voting is still ongoing). While many houses turned out beautifully, the Chris and Ryan duo was specially chaotic.",
          "image": "images/dec 2024 gingerbread house.jpg"
        },
        {
          "image": "images/dec 2024 home alone and doomscrolling.jpg",
          "title": "Home Alone Movie Night + Group Doomscrolling",
          "date": "Dec 8th, 2024",
          "content": "In the spirit of the holidays, we gathered over two nights during finals week to watch Home Alone 1 and 2. After the movies, we spent time doom scrolling together, connecting our Instagram Reels feeds to the giant tv, letting ourselves doomscroll together before getting back to the studying grind."
        },
        {
          "images": [
            "images/dec 2024 basketball concessions alpha team.JPG",
            "images/dec 2024 basketball concessions beta team.JPG"
           ]
        },
        {
          "title": "Basketball Game Concessions",
          "date": "Dec 8th, 2024",
          "content": "For our final concessions shift of the semester, we headed to John Paul Jones Arena to run concessions for the men's basketball game. It was a typical shift, but with the twist that the two MARS teams were stationed in competing stands on the 100-level section. This gave us a unique advantage with a monopoly, but also sparked a friendly competition to see who could sell the most. We ended the night with a massive haul of leftover concessions food, which Craig, Ben, Jordan, and Gabe seized the opportunity to create a glizzy tribute.",
          "image": "images/dec 2024 basketball concessions team.JPG"
        },
        {
          "images": [
            "images/dec 2024 basketball glizzy session.jpg",
            "images/dec 2024 basketball glizzy session 2.jpg"
           ]
        },
        {
          "content": "Here's to another semester of cherished memories,<br>Amith (from amithp.com)"
        }
      ]
    },
    {
      "id": "mar2024",
      "title": "Won’t You Be MARS’ Valentine? January and February Recap!",
      "author": "Cayla Celis",
      "date": "March 10th 2024",
      "subtitle": "Hey everyone! So much has happened from our last update, so let’s get started!",
      "sections": [
        {
          "image": "images/girl scout outreach event.png",
          "title": "Girl Scout Outreach Event",
          "content": "We started off the semester with a bang! ...er, outreach event! Before classes resumed, a few of our members (including me!) gave a presentation to local high school Girl Scout Troop 559 about the Artemis Mission, the NASA Lunabotics Competition, NASA opportunities for HS and college students. In between the presentation, we gave the troop a tour around Lacy and our club room as well as make them make a robot prototype out of craft supplies! It was a blast hosting the event, and it was especially fun to see the Girl Scouts get really into creating the prototype. It was also fun to see them be super excited about following us on Instagram (which you, dear reader, should do too!). While they may not directly work in STEM-related careers in the future, I hope the event encourages them to not shy away from STEM if they are interested!"
        },
        {
          "title": "CDR",
          "content": "With the new semester came our next major design review: the Critical Design Review (CDR)! Because there were so many final design modifications, FEA (Finite Element Analysis), and other calculations that happened in-between the PDR and the CDR, we decided to split the CDR into two sessions: one that focused on the computer science and electronics of the robot and one that focused on its mechanical aspects. Both sessions were very productive, all thanks to external reviewers Professor Natasha Smith, Professor Joseph Zhu, Professor Keith Williams, Professor Brad Campbell, graduate student Sarah Hemler, and club founder Neeraj Gandhi!"
        },
        {
          "title": "Valentine Volleyball",
          "content": "To celebrate finishing the CDR as well as Valentine’s Day, we hosted another volleyball game: Electrical & Computer vs. Mechanical! Like the last one, Mechanical got utterly destroyed, but everyone had fun playing (even the Mechanical members that were there to get their glasses broken)! While I wish my valentine could make it, MARS was there to fill the void in my heart!",
          "image": "images/march volleyball practice.jpg"
        },
        {
          "image": "images/Super Bowl Watch Party.png",
          "title": "Super Bowl Watch Party",
          "content": "The day after our volleyball game, there was another game on TV: the Super Bowl. MARS members gathered at Mechanical Lead Connor’s apartment for some football, chips, yummy mozzarella sticks, and super fun! While it’s always fun working with other members on the robot, it’s always fun just hanging out and getting to know everyone in a casual setting! MARS is my community, and I hope other members feel the same way about MARS as well!"
        },
        {
          "title": "NSBE Jr Activity",
          "content": "The week after Valentine's Day we hosted an event at the Albemarle’s High School NSBE Jr. chapter. We taught them a bit about the Artemis program and pseudocode and had them build their own solar-powered robots. While there were certainly a bit of road bumps using the solar power part of the robots, thanks to Mrs. Barnes’ great idea in using a halogen lamp for the robot’s light source, their robots were able to move throughout the mock arena! Overall, everyone had a blast (and free pizza)!",
          "image": "images/NSBE Jr Activity.png"
        },
        {
          "image": "images/mar2024 Manufacturing + Assembly Time!.png",
          "title": "Manufacturing + Assembly Time!",
           "content": "Beyond social and outreach events, we’ve been hard at work with starting manufacturing, especially since the waterjet was down for at least two weeks! For starters, we’ve: Started assembling the chassis and the wheels of the robot. The wheels have been quite time-intensive, with aluminum needing to be cut and rolled and cut and rolled… Start machining some parts of the construction subsystem responsible for creating the berm to be built in the construction zone. Solved bolt interference problems within the construction subsystem. While we’re a bit behind schedule, I guess you could say that despite the bumps, we’re going at full speed ahead!"
        },
        {
          "title": "Coming up!",
          "content": "While everyone in MARS are currently off grounds for spring break, we have been hard at work making sure everything is done before the Proof of Life deadline!  Hope you all stick around for our March recap blog post and follow our social media, but for now, keep an eye on our Proof of Life video! Hehe, we can’t wait to show you the robot soon! <br><br> See you all again soon,<br>Cayla"
        }
      ]
    }
  ]
}
